doc/cl-postgres.org
#+TITLE: Cl-Postgres Reference Manual
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+OPTIONS: ^:nil

The CL-postgres module implements a rather low-level interface for
communicating with a PostgreSQL database server. It is part of the Postmodern
library, but can be used separately.


* Connecting
** class database-connection

Objects of this type represent database connections.

** function open-database (database user password host &optional (port 5432) (use-ssl :no))
→ database-connection

Create and open a connection for the specified server, database, and user.
use-ssl may be :no, :try, :yes, or :full; where :try means 'if the server
supports it', :yes means 'expect a CA-signed cert from the server, for any host
name', and :full 'means expect a CA-signed cert for the supplied host name'.
When it is anything but :no, you must have the CL+SSL package loaded to initiate
the connection.

On SBCL and Clozure CL, the value :unix may be passed for host, in order to
connect using a Unix domain socket instead of a TCP socket.

** function close-database (database-connection)

Close a database connection. It is advisable to call this on connections when
you are done with them. Otherwise the open socket will stick around until it
is garbage collected, and no one will tell the database server that we are done
with it.

** function reopen-database (database-connection)

Re-establish a database connection for a previously closed connection object.
(Calling this on a connection that is still open is harmless.)

** function database-open-p (database-connection)
→ boolean

Test whether a database connection is still open.

** method connection-meta (database-connection)
→ hash-table

This method provides access to a hash table that is associated with the
current database connection, and is used to store information about the
prepared statements that have been parsed for this connection.

** method connection-parameters (database-connection)
→ hash-table

This method returns a mapping (string to string) containing all the
configuration parameters for the connection.

variable *unix-socket-dir*

On SBCL, when using the :unix keyword as host argument when creating a
connection, this variable determines the directory in which CL-Postgres
will look for the socket file.

variable *ssl-certificate-file*
variable *ssl-key-file*

When using SSL (see open-database), these can be used to provide client key
and certificate files. They can be either NIL, for no file, or a pathname.

** function wait-for-notification (database-connection)

This function blocks until a notification is received on the connection.
The PostgreSQL LISTEN command must be used to enable listening for
notifications.

* Querying
** function exec-query (database-connection query &optional (row-reader 'ignore-row-reader))
→ result

Sends the given query to the given connection, and interprets the results (if
there are any) with the given row-reader. If the database returns information
about the amount of rows affected, this is returned as a second value.

** function prepare-query (database-connection name query)

Parse and plan the given query, and store it under the given name. Note that
prepared statements are per-connection, so they can only be executed through
the same connection that prepared them.

** function exec-prepared (database-connection name parameters &optional (row-reader 'ignore-row-reader))
→ result

Execute the prepared statement by the given name. Parameters should be given
as a list. Each value in this list should be of a type that to-sql-string has
been specialised on. (Byte arrays will be passed in their binary form,
without being put through to-sql-string.) The result of the executing the
statement, if any, is interpreted by the given row reader, and returned.
Again, the number or affected rows is optionally returned as a second value.

** function unprepare-query (database-connection name)

Close the prepared statement by the given name. This will free resources and
allow the name to be associated with a new prepared query.

