doc/cl-postgres.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-17 Thu 13:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cl-Postgres Reference Manual</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Cl-Postgres Reference Manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2e171b9">Connecting</a>
<ul>
<li><a href="#org41014cb">class database-connection</a></li>
<li><a href="#orgea81ebe">function open-database (database user password host &amp;optional (port 5432) (use-ssl :no))</a></li>
<li><a href="#org3c403ea">function close-database (database-connection)</a></li>
<li><a href="#org519b144">function reopen-database (database-connection)</a></li>
<li><a href="#orgfb21b45">function database-open-p (database-connection)</a></li>
<li><a href="#orgdea4b42">method connection-meta (database-connection)</a></li>
<li><a href="#orgbb2163a">method connection-parameters (database-connection)</a></li>
<li><a href="#orge57e486">function wait-for-notification (database-connection)</a></li>
</ul>
</li>
<li><a href="#orgd4de93b">Querying</a>
<ul>
<li><a href="#org87134bc">function exec-query (database-connection query &amp;optional (row-reader 'ignore-row-reader))</a></li>
<li><a href="#orge157c72">function prepare-query (database-connection name query)</a></li>
<li><a href="#org264de59">function exec-prepared (database-connection name parameters &amp;optional (row-reader 'ignore-row-reader))</a></li>
<li><a href="#org6d1a6e5">function unprepare-query (database-connection name)</a></li>
<li><a href="#org64b4ca7">method to-sql-string (value)</a></li>
<li><a href="#orgb1c0210">variable <b>silently-truncate-rationals</b></a></li>
<li><a href="#org7d2ae12">variable <b>query-log</b></a></li>
<li><a href="#orgd8e6756">variable <b>query-callback</b></a></li>
<li><a href="#orge08d274">function log-query (query internal-time)</a></li>
</ul>
</li>
<li><a href="#orgafb9b88">Reading values</a>
<ul>
<li><a href="#org0d937c3">function copy-sql-readtable (table)</a></li>
<li><a href="#org8de63a6">function default-sql-readtable ()</a></li>
<li><a href="#org94bc150">function set-sql-reader (oid function &amp;key table binary-p)</a></li>
<li><a href="#orga55e648">function set-sql-datetime-readers (&amp;key date timestamp timestamp-with-timezone time interval table)</a></li>
</ul>
</li>
<li><a href="#org1be36c4">Row readers</a>
<ul>
<li><a href="#orgdeb814e">macro row-reader ((fields) &amp;body body)</a></li>
<li><a href="#orgdfd42f3">macro def-row-reader (name (fields) &amp;body body)</a></li>
<li><a href="#org50c6504">method field-name (field)</a></li>
<li><a href="#org914a5b2">method field-type (field)</a></li>
<li><a href="#orgfba7f87">function list-row-reader (socket fields)</a></li>
<li><a href="#org8fd1c4f">function alist-row-reader (socket fields)</a></li>
<li><a href="#org305d59e">function ignore-row-reader (socket fields)</a></li>
</ul>
</li>
<li><a href="#orgcd13f3b">Bulk Copying</a>
<ul>
<li><a href="#org1957117">function open-db-writer (db table &amp;optional columns)</a></li>
<li><a href="#orge36a00c">function close-db-writer (writer &amp;key abort)</a></li>
<li><a href="#org3a94784">function db-write-row (writer row-data)</a></li>
</ul>
</li>
<li><a href="#org9f741e7">Conditions</a>
<ul>
<li><a href="#org436298c">condition database-error</a></li>
<li><a href="#orgd3f99de">method database-error-message (database-error)</a></li>
<li><a href="#orgdc2b421">method database-error-detail (database-error)</a></li>
<li><a href="#org9fcd1a1">method database-error-code (database-error)</a></li>
<li><a href="#orge0e3083">method database-error-query (database-error)</a></li>
<li><a href="#orgcaf14a3">method database-error-cause (database-error)</a></li>
<li><a href="#org721f27f">function database-error-constraint-name (database-error)</a></li>
<li><a href="#org721f27f">function database-error-extract-name (database-error)</a></li>
<li><a href="#orgea749ec">condition database-connection-error</a></li>
<li><a href="#org37e5d1b">condition postgresql-notification</a></li>
<li><a href="#orge62533e">method postgresql-notification-channel (postgresql-notification)</a></li>
<li><a href="#org1ad01e5">method postgresql-notification-payload (postgresql-notification)</a></li>
<li><a href="#org5d3d780">method postgresql-notification-pid (postgresql-notification)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The CL-postgres module implements a rather low-level interface for
communicating with a PostgreSQL database server. It is part of the Postmodern
library, but can be used separately.
</p>


<div id="outline-container-org2e171b9" class="outline-2">
<h2 id="org2e171b9">Connecting</h2>
<div class="outline-text-2" id="text-org2e171b9">
</div>
<div id="outline-container-org41014cb" class="outline-3">
<h3 id="org41014cb">class database-connection</h3>
<div class="outline-text-3" id="text-org41014cb">
<p>
Objects of this type represent database connections.
</p>
</div>
</div>

<div id="outline-container-orgea81ebe" class="outline-3">
<h3 id="orgea81ebe">function open-database (database user password host &amp;optional (port 5432) (use-ssl :no))</h3>
<div class="outline-text-3" id="text-orgea81ebe">
<p>
→ database-connection
</p>

<p>
Create and open a connection for the specified server, database, and user.
use-ssl may be :no, :try, :yes, or :full; where :try means 'if the server
supports it', :yes means 'expect a CA-signed cert from the server, for any host
name', and :full 'means expect a CA-signed cert for the supplied host name'.
When it is anything but :no, you must have the CL+SSL package loaded to initiate
the connection.
</p>

<p>
On SBCL and Clozure CL, the value :unix may be passed for host, in order to
connect using a Unix domain socket instead of a TCP socket.
</p>
</div>
</div>

<div id="outline-container-org3c403ea" class="outline-3">
<h3 id="org3c403ea">function close-database (database-connection)</h3>
<div class="outline-text-3" id="text-org3c403ea">
<p>
Close a database connection. It is advisable to call this on connections when
you are done with them. Otherwise the open socket will stick around until it
is garbage collected, and no one will tell the database server that we are done
with it.
</p>
</div>
</div>

<div id="outline-container-org519b144" class="outline-3">
<h3 id="org519b144">function reopen-database (database-connection)</h3>
<div class="outline-text-3" id="text-org519b144">
<p>
Re-establish a database connection for a previously closed connection object.
(Calling this on a connection that is still open is harmless.)
</p>
</div>
</div>

<div id="outline-container-orgfb21b45" class="outline-3">
<h3 id="orgfb21b45">function database-open-p (database-connection)</h3>
<div class="outline-text-3" id="text-orgfb21b45">
<p>
→ boolean
</p>

<p>
Test whether a database connection is still open.
</p>
</div>
</div>

<div id="outline-container-orgdea4b42" class="outline-3">
<h3 id="orgdea4b42">method connection-meta (database-connection)</h3>
<div class="outline-text-3" id="text-orgdea4b42">
<p>
→ hash-table
</p>

<p>
This method provides access to a hash table that is associated with
the current database connection, and is used to store information
about the prepared statements that have been parsed for this
connection.
</p>
</div>
</div>
<div id="outline-container-orgbb2163a" class="outline-3">
<h3 id="orgbb2163a">method connection-parameters (database-connection)</h3>
<div class="outline-text-3" id="text-orgbb2163a">
<p>
→ hash-table
</p>

<p>
This method returns a mapping (string to string) containing all the
configuration parameters for the connection.
</p>

<p>
variable <b>unix-socket-dir</b>
</p>

<p>
On SBCL, when using the :unix keyword as host argument when creating a
connection, this variable determines the directory in which CL-Postgres
will look for the socket file.
</p>

<p>
variable <b>ssl-certificate-file</b>
variable <b>ssl-key-file</b>
</p>

<p>
When using SSL (see open-database), these can be used to provide client key
and certificate files. They can be either NIL, for no file, or a pathname.
</p>
</div>
</div>

<div id="outline-container-orge57e486" class="outline-3">
<h3 id="orge57e486">function wait-for-notification (database-connection)</h3>
<div class="outline-text-3" id="text-orge57e486">
<p>
This function blocks until a notification is received on the connection.
The PostgreSQL LISTEN command must be used to enable listening for
notifications.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd4de93b" class="outline-2">
<h2 id="orgd4de93b">Querying</h2>
<div class="outline-text-2" id="text-orgd4de93b">
</div>
<div id="outline-container-org87134bc" class="outline-3">
<h3 id="org87134bc">function exec-query (database-connection query &amp;optional (row-reader 'ignore-row-reader))</h3>
<div class="outline-text-3" id="text-org87134bc">
<p>
→ result
</p>

<p>
Sends the given query to the given connection, and interprets the results (if
there are any) with the given row-reader. If the database returns information
about the amount of rows affected, this is returned as a second value.
</p>
</div>
</div>

<div id="outline-container-orge157c72" class="outline-3">
<h3 id="orge157c72">function prepare-query (database-connection name query)</h3>
<div class="outline-text-3" id="text-orge157c72">
<p>
Parse and plan the given query, and store it under the given name. Note that
prepared statements are per-connection, so they can only be executed through
the same connection that prepared them.
</p>
</div>
</div>

<div id="outline-container-org264de59" class="outline-3">
<h3 id="org264de59">function exec-prepared (database-connection name parameters &amp;optional (row-reader 'ignore-row-reader))</h3>
<div class="outline-text-3" id="text-org264de59">
<p>
→ result
</p>

<p>
Execute the prepared statement by the given name. Parameters should be given
as a list. Each value in this list should be of a type that to-sql-string has
been specialised on. (Byte arrays will be passed in their binary form,
without being put through to-sql-string.) The result of the executing the
statement, if any, is interpreted by the given row reader, and returned.
Again, the number or affected rows is optionally returned as a second value.
</p>
</div>
</div>

<div id="outline-container-org6d1a6e5" class="outline-3">
<h3 id="org6d1a6e5">function unprepare-query (database-connection name)</h3>
<div class="outline-text-3" id="text-org6d1a6e5">
<p>
Close the prepared statement by the given name. This will free resources and
allow the name to be associated with a new prepared query.
</p>
</div>
</div>
