doc/cl-postgres.org
** method to-sql-string (value)
→ (values string needs-escaping)

Convert a Lisp value to its textual unescaped SQL representation. Returns a
second value indicating whether this value should be escaped if it is to be
put directly into a query.

You can define to-sql-string methods for your own datatypes if you want to be
able to pass them to exec-prepared. When a non-NIL second value is returned,
this may be T to indicate that the first value should simply be escaped as a
string, or a second string providing a type prefix for the value. (This is
used by S-SQL.)

** variable *silently-truncate-rationals*

When a rational number is passed into a query (as per to-sql-string), but it
can not be expressed within 38 decimal digits (for example 1/3), it will be
truncated, and lose some precision. Set this variable to nil to suppress
that behaviour and raise an error instead.

** variable *query-log*

When debugging, it can be helpful to inspect the queries that are being sent
to the database. Set this variable to an output stream value (*standard-output*,
for example) to have CL-postgres log every query it makes.

** variable *query-callback*

When profiling or debugging, the *query-log* may not give enough information,
or reparsing its output may not be feasible. This variable may be set to a
designator of function taking two arguments. This function will be then called
after every query, and receive query string and internal time units (as in
(CL:GET-INTERNAL-REAL-TIME)) spent in query as its arguments.

Default value of this variable is 'LOG-QUERY, which takes care of *QUERY-LOG*
processing. If you provide custom query callback and wish to keep *QUERY-LOG*
functionality, you will have to call LOG-QUERY from your callback function

** function log-query (query internal-time)

This function is default value of *QUERY-CALLBACK* and logs queries
to *QUERY-LOG* if it is not NIL.

* Reading values
CL-postgres knows how to convert commonly used PostgreSQL data types to Lisp
values. This table shows the mapping:

| PostgreSQL	     | Lisp                       |
| smallint	       | integer                    |
| integer          | 	integer                  |
| bigint	         | integer                    |
| numeric	        | ratio                      |
| real	           | float                      |
| double precision | 	double-float             |
| boolean	        | boolean                    |
| varchar          | 	string                   |
| text	           | string                     |
| bytea	          | (vector (unsigned-byte 8)) |
| array            | array                      |
The mapping from PostgreSQL types (identified by OID numbers) to the functions
that interpret them is kept in so-called SQL readtables. All types for which
no reader is defined will be returned as string values containing their
PostgreSQL representation.

variable *sql-readtable*

This variable is used to choose the current readtable. For simple use, you
will not have to touch this, but it is possible that code within a Lisp image
requires different readers in different situations, in which case you can
create separate read tables.

** function copy-sql-readtable (table)
→ readtable

Copies a given readtable.

** function default-sql-readtable ()
→ readtable

Returns the default readtable, containing only the readers defined by
CL-postgres itself.

** function set-sql-reader (oid function &key table binary-p)

Define a new reader for a given type. table defaults to *sql-readtable*.
The reader function should take a single argument, a string, and transform
that into some kind of equivalent Lisp value. When binary-p is true, the reader
function is supposed to directly read the binary representation of the value.
In most cases this is not recommended, but if you want to use it: provide a
function that takes a binary input stream and an integer (the size of the
value, in bytes), and reads the value from that stream. Note that reading
less or more bytes than the given size will horribly break your connection.

** function set-sql-datetime-readers (&key date timestamp timestamp-with-timezone time interval table)

Since there is no widely recognised standard way of representing dates and
times in Common Lisp, and reading these from string representation is clunky
and slow, this function provides a way to easily plug in binary readers for
the date, time, timestamp, and interval types. It should be given functions
with the following signatures:

- :date (days)

Where days is the amount of days since January 1st, 2000.

- :timestamp (useconds)

Timestamps have a microsecond resolution. Again, the zero point is the start
of the year 2000, UTC.

- :timestamp-with-timezone

Like :timestamp, but for values of the 'timestamp with time zone' type (which
PostgreSQL internally stores exactly the same as regular timestamps).

- :time (useconds)

Refers to a time of day, counting from midnight.

- :interval (months days useconds)

An interval is represented as several separate components. The reason that days
and microseconds are separated is that you might want to take leap seconds into
account.

* Row readers
Row readers are a way to read and group the results of queries. Roughly, they
are functions that perform the iteration over the rows and cells in the
result, and do something with the returned values.

