doc/cl-postgres.html

<div id="outline-container-org64b4ca7" class="outline-3">
<h3 id="org64b4ca7">method to-sql-string (value)</h3>
<div class="outline-text-3" id="text-org64b4ca7">
<p>
→ (values string needs-escaping)
</p>

<p>
Convert a Lisp value to its textual unescaped SQL representation. Returns a
second value indicating whether this value should be escaped if it is to be
put directly into a query.
</p>

<p>
You can define to-sql-string methods for your own datatypes if you want to be
able to pass them to exec-prepared. When a non-NIL second value is returned,
this may be T to indicate that the first value should simply be escaped as a
string, or a second string providing a type prefix for the value. (This is
used by S-SQL.)
</p>
</div>
</div>

<div id="outline-container-orgb1c0210" class="outline-3">
<h3 id="orgb1c0210">variable <b>silently-truncate-rationals</b></h3>
<div class="outline-text-3" id="text-orgb1c0210">
<p>
When a rational number is passed into a query (as per to-sql-string), but it
can not be expressed within 38 decimal digits (for example 1/3), it will be
truncated, and lose some precision. Set this variable to nil to suppress
that behaviour and raise an error instead.
</p>
</div>
</div>

<div id="outline-container-org7d2ae12" class="outline-3">
<h3 id="org7d2ae12">variable <b>query-log</b></h3>
<div class="outline-text-3" id="text-org7d2ae12">
<p>
When debugging, it can be helpful to inspect the queries that are being sent
to the database. Set this variable to an output stream value (<b>standard-output</b>,
for example) to have CL-postgres log every query it makes.
</p>
</div>
</div>

<div id="outline-container-orgd8e6756" class="outline-3">
<h3 id="orgd8e6756">variable <b>query-callback</b></h3>
<div class="outline-text-3" id="text-orgd8e6756">
<p>
When profiling or debugging, the <b>query-log</b> may not give enough information,
or reparsing its output may not be feasible. This variable may be set to a
designator of function taking two arguments. This function will be then called
after every query, and receive query string and internal time units (as in
(CL:GET-INTERNAL-REAL-TIME)) spent in query as its arguments.
</p>

<p>
Default value of this variable is 'LOG-QUERY, which takes care of <b>QUERY-LOG</b>
processing. If you provide custom query callback and wish to keep <b>QUERY-LOG</b>
functionality, you will have to call LOG-QUERY from your callback function
</p>
</div>
</div>

<div id="outline-container-orge08d274" class="outline-3">
<h3 id="orge08d274">function log-query (query internal-time)</h3>
<div class="outline-text-3" id="text-orge08d274">
<p>
This function is default value of <b>QUERY-CALLBACK</b> and logs queries
to <b>QUERY-LOG</b> if it is not NIL.
</p>
</div>
</div>
</div>

<div id="outline-container-orgafb9b88" class="outline-2">
<h2 id="orgafb9b88">Reading values</h2>
<div class="outline-text-2" id="text-orgafb9b88">
<p>
CL-postgres knows how to convert commonly used PostgreSQL data types to Lisp
values. This table shows the mapping:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">PostgreSQL</td>
<td class="org-left">Lisp</td>
</tr>

<tr>
<td class="org-left">smallint</td>
<td class="org-left">integer</td>
</tr>

<tr>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
</tr>

<tr>
<td class="org-left">bigint</td>
<td class="org-left">integer</td>
</tr>

<tr>
<td class="org-left">numeric</td>
<td class="org-left">ratio</td>
</tr>

<tr>
<td class="org-left">real</td>
<td class="org-left">float</td>
</tr>

<tr>
<td class="org-left">double precision</td>
<td class="org-left">double-float</td>
</tr>

<tr>
<td class="org-left">boolean</td>
<td class="org-left">boolean</td>
</tr>

<tr>
<td class="org-left">varchar</td>
<td class="org-left">string</td>
</tr>

<tr>
<td class="org-left">text</td>
<td class="org-left">string</td>
</tr>

<tr>
<td class="org-left">bytea</td>
<td class="org-left">(vector (unsigned-byte 8))</td>
</tr>

<tr>
<td class="org-left">array</td>
<td class="org-left">array</td>
</tr>
</tbody>
</table>
<p>
The mapping from PostgreSQL types (identified by OID numbers) to the functions
that interpret them is kept in so-called SQL readtables. All types for which
no reader is defined will be returned as string values containing their
PostgreSQL representation.
</p>

<p>
variable <b>sql-readtable</b>
</p>

<p>
This variable is used to choose the current readtable. For simple use, you
will not have to touch this, but it is possible that code within a Lisp image
requires different readers in different situations, in which case you can
create separate read tables.
</p>
</div>

<div id="outline-container-org0d937c3" class="outline-3">
<h3 id="org0d937c3">function copy-sql-readtable (table)</h3>
<div class="outline-text-3" id="text-org0d937c3">
<p>
→ readtable
</p>

<p>
Copies a given readtable.
</p>
</div>
</div>

<div id="outline-container-org8de63a6" class="outline-3">
<h3 id="org8de63a6">function default-sql-readtable ()</h3>
<div class="outline-text-3" id="text-org8de63a6">
<p>
→ readtable
</p>

<p>
Returns the default readtable, containing only the readers defined by
CL-postgres itself.
</p>
</div>
</div>

<div id="outline-container-org94bc150" class="outline-3">
<h3 id="org94bc150">function set-sql-reader (oid function &amp;key table binary-p)</h3>
<div class="outline-text-3" id="text-org94bc150">
<p>
Define a new reader for a given type. table defaults to <b>sql-readtable</b>.
The reader function should take a single argument, a string, and transform
that into some kind of equivalent Lisp value. When binary-p is true, the reader
function is supposed to directly read the binary representation of the value.
In most cases this is not recommended, but if you want to use it: provide a
function that takes a binary input stream and an integer (the size of the
value, in bytes), and reads the value from that stream. Note that reading
less or more bytes than the given size will horribly break your connection.
</p>
</div>
</div>

<div id="outline-container-orga55e648" class="outline-3">
<h3 id="orga55e648">function set-sql-datetime-readers (&amp;key date timestamp timestamp-with-timezone time interval table)</h3>
<div class="outline-text-3" id="text-orga55e648">
<p>
Since there is no widely recognised standard way of representing dates and
times in Common Lisp, and reading these from string representation is clunky
and slow, this function provides a way to easily plug in binary readers for
the date, time, timestamp, and interval types. It should be given functions
with the following signatures:
</p>

<ul class="org-ul">
<li>:date (days)</li>
</ul>

<p>
Where days is the amount of days since January 1st, 2000.
</p>

<ul class="org-ul">
<li>:timestamp (useconds)</li>
</ul>

<p>
Timestamps have a microsecond resolution. Again, the zero point is the start
of the year 2000, UTC.
</p>

<ul class="org-ul">
<li>:timestamp-with-timezone</li>
</ul>

<p>
Like :timestamp, but for values of the 'timestamp with time zone' type (which
PostgreSQL internally stores exactly the same as regular timestamps).
</p>

<ul class="org-ul">
<li>:time (useconds)</li>
</ul>

<p>
Refers to a time of day, counting from midnight.
</p>

<ul class="org-ul">
<li>:interval (months days useconds)</li>
</ul>

<p>
An interval is represented as several separate components. The reason that days
and microseconds are separated is that you might want to take leap seconds into
account.
</p>
</div>
</div>
</div>

<div id="outline-container-org1be36c4" class="outline-2">
<h2 id="org1be36c4">Row readers</h2>
<div class="outline-text-2" id="text-org1be36c4">
<p>
Row readers are a way to read and group the results of queries. Roughly, they
are functions that perform the iteration over the rows and cells in the
result, and do something with the returned values.
</p>
</div>
