doc/cl-postgres.org
** macro row-reader ((fields) &body body)
→ function

Creates a row-reader, using the given name for the variable. Inside the body
this variable refers to a vector of field descriptions. On top of that, two
local functions are bound, next-row and next-field. The first will start
reading the next row in the result, and returns a boolean indicating whether
there is another row. The second will read and return one field, and should
be passed the corresponding field description from the fields argument as a
parameter.

A row reader should take care to iterate over all the rows in a result, and
within each row iterate over all the fields. This means it should contain
an outer loop that calls next-row, and every time next-row returns T it
should iterate over the fields vector and call next-field for every field.

The definition of list-row-reader should give you an idea what a row reader
looks like:
#+BEGIN_SRC lisp
(row-reader (fields)
  (loop :while (next-row)
        :collect (loop :for field :across fields
                       :collect (next-field field))))
#+END_SRC

Obviously, row readers should not do things with the database connection
like, say, close it or start a new query, since it still reading out the
results from the current query.

** macro def-row-reader (name (fields) &body body)

The defun-like variant of row-reader: creates a row reader and gives it a
top-level function name.

** method field-name (field)
→ string

This can be used to get information about the fields read by a row reader.
Given a field description, it returns the name the database associated with
this column.

** method field-type (field)
→ oid

This extracts the PostgreSQL OID associated with this column. You can, if
you really want to, query the pg_types table to find out more about the
types denoted by OIDs.

** function list-row-reader (socket fields)
→ list

A row reader that builds a list of lists from the query results.

** function alist-row-reader (socket fields)
→ alist

A row reader that returns a list of alists, which associate column names with
values.

** function ignore-row-reader (socket fields)

A row reader that completely ignores the result of a query.

* Bulk Copying
When loading large amounts of data into PostgreSQL, it can be done
significantly faster using the bulk copying feature. The drawback to this
approach is that you don't find out about data integrity errors until the
entire batch is completed but sometimes the speed is worth it

** function open-db-writer (db table &optional columns)

Opens a table stream into which rows can be written one at a time using
db-write-row. db is either a connection object or a list of arguments that
could be passed to open-database. table is the name of an existing table
into which this writer will write rows. If you don't have data for all
columns, use columns to indicate those that you do.

** function close-db-writer (writer &key abort)

Closes a bulk writer opened by open-db-writer. Will close the associated
database connection when it was created for this copier, or abort is true.

** function db-write-row (writer row-data)

Writes row-data into the table and columns referenced by the writer.
row-data is a list of Lisp objects, one for each column included when
opening the writer. Arrays (the elements of which must all be the same type)
will be serialized into their PostgreSQL representation before being written
into the DB.

* Conditions
Opening or querying a database may raise errors. CL-postgres will wrap the
errors that the server returns in a lisp condition, and raise conditions of
the same type when it detects some problem itself. Socket errors are let
through as they are.

** condition database-error

The type of database-related conditions. For errors that you may want to
catch by type, the cl-postgres-error package defines a bucket of subtypes
used for specific errors. See the cl-postgres/package.lisp file for a list.

** method database-error-message (database-error)
→ string

A short message associated with this error.

** method database-error-detail (database-error)
→ string

A longer description of the problem, or NIL if none is available.

** method database-error-code (database-error)
→ string

The error code PostgreSQL associated with this error, if any. See the
PostgreSQL manual for their meaning.

** method database-error-query (database-error)
→ string

The query that led to this error, or NIL if no query was involved.

** method database-error-cause (database-error)
→ condition

The condition that caused this error, or NIL when it was not caused by another
condition.

** function database-error-constraint-name (database-error)
→ string

For integrity-violation errors, returns the name of the constraint that was
violated (or nil if no constraint was found.)

** function database-error-extract-name (database-error)
→ string

For various errors, returns the name provided by the error message
 (or nil if no such name was found.)

** condition database-connection-error

Subtype of database-error. An error of this type (or one of its subclasses)
is signaled when a query is attempted with a connection object that is no
longer connected, or a database connection becomes invalid during a query.
Always provides a :reconnect restart, which will cause the library to make an
attempt to restore the connection and re-try the query.

The following shows an example use of this feature, a way to ensure that the
first connection error causes a reconnect attempt, while others pass through
as normal. A variation on this theme could continue trying to reconnect, with
successively longer pauses.
#+BEGIN_SRC lisp
(defun call-with-single-reconnect (fun)
  (let ((reconnected nil))
    (handler-bind
        ((database-connection-error
          (lambda (err)
            (when (not reconnected)
              (setf reconnected t)
              (invoke-restart :reconnect)))))
      (funcall fun))))
#+END_SRC

** condition postgresql-notification

The condition that is signalled when a notification message is received from
the PostgreSQL server. This is a WARNING condition which is caught by the
WAIT-FOR-NOTIFICATION function that implements synchronous waiting for
notifications.

