doc/cl-postgres.html

<div id="outline-container-orgdeb814e" class="outline-3">
<h3 id="orgdeb814e">macro row-reader ((fields) &amp;body body)</h3>
<div class="outline-text-3" id="text-orgdeb814e">
<p>
→ function
</p>

<p>
Creates a row-reader, using the given name for the variable. Inside the body
this variable refers to a vector of field descriptions. On top of that, two
local functions are bound, next-row and next-field. The first will start
reading the next row in the result, and returns a boolean indicating whether
there is another row. The second will read and return one field, and should
be passed the corresponding field description from the fields argument as a
parameter.
</p>

<p>
A row reader should take care to iterate over all the rows in a result, and
within each row iterate over all the fields. This means it should contain
an outer loop that calls next-row, and every time next-row returns T it
should iterate over the fields vector and call next-field for every field.
</p>

<p>
The definition of list-row-reader should give you an idea what a row reader
looks like:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(row-reader (fields)
  (loop :while (next-row)
        :collect (loop :for field :across fields
                       :collect (next-field field))))
</pre>
</div>

<p>
Obviously, row readers should not do things with the database connection
like, say, close it or start a new query, since it still reading out the
results from the current query.
</p>
</div>
</div>

<div id="outline-container-orgdfd42f3" class="outline-3">
<h3 id="orgdfd42f3">macro def-row-reader (name (fields) &amp;body body)</h3>
<div class="outline-text-3" id="text-orgdfd42f3">
<p>
The defun-like variant of row-reader: creates a row reader and gives it a
top-level function name.
</p>
</div>
</div>

<div id="outline-container-org50c6504" class="outline-3">
<h3 id="org50c6504">method field-name (field)</h3>
<div class="outline-text-3" id="text-org50c6504">
<p>
→ string
</p>

<p>
This can be used to get information about the fields read by a row reader.
Given a field description, it returns the name the database associated with
this column.
</p>
</div>
</div>

<div id="outline-container-org914a5b2" class="outline-3">
<h3 id="org914a5b2">method field-type (field)</h3>
<div class="outline-text-3" id="text-org914a5b2">
<p>
→ oid
</p>

<p>
This extracts the PostgreSQL OID associated with this column. You can, if
you really want to, query the pg_types table to find out more about the
types denoted by OIDs.
</p>
</div>
</div>

<div id="outline-container-orgfba7f87" class="outline-3">
<h3 id="orgfba7f87">function list-row-reader (socket fields)</h3>
<div class="outline-text-3" id="text-orgfba7f87">
<p>
→ list
</p>

<p>
A row reader that builds a list of lists from the query results.
</p>
</div>
</div>

<div id="outline-container-org8fd1c4f" class="outline-3">
<h3 id="org8fd1c4f">function alist-row-reader (socket fields)</h3>
<div class="outline-text-3" id="text-org8fd1c4f">
<p>
→ alist
</p>

<p>
A row reader that returns a list of alists, which associate column names with
values.
</p>
</div>
</div>

<div id="outline-container-org305d59e" class="outline-3">
<h3 id="org305d59e">function ignore-row-reader (socket fields)</h3>
<div class="outline-text-3" id="text-org305d59e">
<p>
A row reader that completely ignores the result of a query.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcd13f3b" class="outline-2">
<h2 id="orgcd13f3b">Bulk Copying</h2>
<div class="outline-text-2" id="text-orgcd13f3b">
<p>
When loading large amounts of data into PostgreSQL, it can be done
significantly faster using the bulk copying feature. The drawback to this
approach is that you don't find out about data integrity errors until the
entire batch is completed but sometimes the speed is worth it
</p>
</div>

<div id="outline-container-org1957117" class="outline-3">
<h3 id="org1957117">function open-db-writer (db table &amp;optional columns)</h3>
<div class="outline-text-3" id="text-org1957117">
<p>
Opens a table stream into which rows can be written one at a time using
db-write-row. db is either a connection object or a list of arguments that
could be passed to open-database. table is the name of an existing table
into which this writer will write rows. If you don't have data for all
columns, use columns to indicate those that you do.
</p>
</div>
</div>

<div id="outline-container-orge36a00c" class="outline-3">
<h3 id="orge36a00c">function close-db-writer (writer &amp;key abort)</h3>
<div class="outline-text-3" id="text-orge36a00c">
<p>
Closes a bulk writer opened by open-db-writer. Will close the associated
database connection when it was created for this copier, or abort is true.
</p>
</div>
</div>

<div id="outline-container-org3a94784" class="outline-3">
<h3 id="org3a94784">function db-write-row (writer row-data)</h3>
<div class="outline-text-3" id="text-org3a94784">
<p>
Writes row-data into the table and columns referenced by the writer.
row-data is a list of Lisp objects, one for each column included when
opening the writer. Arrays (the elements of which must all be the same type)
will be serialized into their PostgreSQL representation before being written
into the DB.
</p>
</div>
</div>
</div>

<div id="outline-container-org9f741e7" class="outline-2">
<h2 id="org9f741e7">Conditions</h2>
<div class="outline-text-2" id="text-org9f741e7">
<p>
Opening or querying a database may raise errors. CL-postgres will wrap the
errors that the server returns in a lisp condition, and raise conditions of
the same type when it detects some problem itself. Socket errors are let
through as they are.
</p>
</div>

<div id="outline-container-org436298c" class="outline-3">
<h3 id="org436298c">condition database-error</h3>
<div class="outline-text-3" id="text-org436298c">
<p>
The type of database-related conditions. For errors that you may want to
catch by type, the cl-postgres-error package defines a bucket of subtypes
used for specific errors. See the cl-postgres/package.lisp file for a list.
</p>
</div>
</div>

<div id="outline-container-orgd3f99de" class="outline-3">
<h3 id="orgd3f99de">method database-error-message (database-error)</h3>
<div class="outline-text-3" id="text-orgd3f99de">
<p>
→ string
</p>

<p>
A short message associated with this error.
</p>
</div>
</div>

<div id="outline-container-orgdc2b421" class="outline-3">
<h3 id="orgdc2b421">method database-error-detail (database-error)</h3>
<div class="outline-text-3" id="text-orgdc2b421">
<p>
→ string
</p>

<p>
A longer description of the problem, or NIL if none is available.
</p>
</div>
</div>

<div id="outline-container-org9fcd1a1" class="outline-3">
<h3 id="org9fcd1a1">method database-error-code (database-error)</h3>
<div class="outline-text-3" id="text-org9fcd1a1">
<p>
→ string
</p>

<p>
The error code PostgreSQL associated with this error, if any. See the
PostgreSQL manual for their meaning.
</p>
</div>
</div>

<div id="outline-container-orge0e3083" class="outline-3">
<h3 id="orge0e3083">method database-error-query (database-error)</h3>
<div class="outline-text-3" id="text-orge0e3083">
<p>
→ string
</p>

<p>
The query that led to this error, or NIL if no query was involved.
</p>
</div>
</div>

<div id="outline-container-orgcaf14a3" class="outline-3">
<h3 id="orgcaf14a3">method database-error-cause (database-error)</h3>
<div class="outline-text-3" id="text-orgcaf14a3">
<p>
→ condition
</p>

<p>
The condition that caused this error, or NIL when it was not caused by another
condition.
</p>
</div>
</div>

<div id="outline-container-org721f27f" class="outline-3">
<h3 id="org721f27f">function database-error-constraint-name (database-error)</h3>
<div class="outline-text-3" id="text-org721f27f">
<p>
→ string
</p>

<p>
For integrity-violation errors, returns the name of the constraint that was
violated (or nil if no constraint was found.)
</p>
</div>
<h3 id="">function database-error-extract-name (database-error)</h3>
<div class="outline-text-3" id="">
<p>
→ string
</p>

<p>
For various errors, returns the name provided by the error message
 (or nil if no such name was found.)
</p>
</div>
</div>

<div id="outline-container-orgea749ec" class="outline-3">
<h3 id="orgea749ec">condition database-connection-error</h3>
<div class="outline-text-3" id="text-orgea749ec">
<p>
Subtype of database-error. An error of this type (or one of its subclasses)
is signaled when a query is attempted with a connection object that is no
longer connected, or a database connection becomes invalid during a query.
Always provides a :reconnect restart, which will cause the library to make an
attempt to restore the connection and re-try the query.
</p>

<p>
The following shows an example use of this feature, a way to ensure that the
first connection error causes a reconnect attempt, while others pass through
as normal. A variation on this theme could continue trying to reconnect, with
successively longer pauses.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defun call-with-single-reconnect (fun)
  (let ((reconnected nil))
    (handler-bind
        ((database-connection-error
          (lambda (err)
            (when (not reconnected)
              (setf reconnected t)
              (invoke-restart :reconnect)))))
      (funcall fun))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org37e5d1b" class="outline-3">
<h3 id="org37e5d1b">condition postgresql-notification</h3>
<div class="outline-text-3" id="text-org37e5d1b">
<p>
The condition that is signalled when a notification message is received from
the PostgreSQL server. This is a WARNING condition which is caught by the
WAIT-FOR-NOTIFICATION function that implements synchronous waiting for
notifications.
</p>
</div>
</div>
